//#include <iostream>
//#include <deque>
//using namespace std;
//
////Написать программу, в которой нужно найти произведение всех элементов деки и вывести его на экран
//
//void main() {
//	deque<int>deq;
//	int mult = 1;
//
//	for (int i = 0; i < 5; i++) {
//	 deq.push_back(rand() % 9 + 1);
//	}
//
//	for (int i = 0; i < deq.size(); i++) {
//		mult *= deq[i];
//	}
//
//	printf("Multiplication is %d", mult);
//}