//#include <iostream>
//#include <vector>
//using namespace std;
//
////Написать программу, в которой нужно найти сумму всех элементов вектора и вывести ее на экран
//
//void main() {
//	vector<int>vect;
//	int sum = 0;
//
//	for (int i = 0; i < 5; i++) {
//		vect.push_back(rand() % 10);
//	}
//
//	for (int i = 0; i < vect.size(); i++) {
//		sum += vect[i];
//	}
//	printf("Sum is %d", sum);
//}