//#include <iostream>
//#include <forward_list>
//using namespace std;
//
////Написать программу, в которой в конец односвязного списка добавляется n элементов и вывести на экран
//
//int main()
//{
// forward_list<int> arr = { 1, 2, 3 };
// auto it1 = arr.begin(), it2 = arr.end(); // итераторы указыв на 1ый и послед элемент
// while (next(it1) != it2) ++it1;
// arr.insert_after(it1, 5, 4); // В конец списка
// for (int& el : arr) cout << el << ' ';
// cout << endl;
//}