//#include <iostream>
//#include <list>
//using namespace std;
//
////Написать программу, в которой в начало двусвязного списка добавляется n элементов и вывести на экран
//
//void main() {
//	list<int>mylist = { 5, 1, 9, 4, 6 };
//	int n;
//	scanf_s("%d", &n);
//	auto iter = mylist.begin();
//	for (int i = 0; i < n; i++) {
//		mylist.push_front(15);
//	}
//	for (int k : mylist) {
//		printf("%d\t", k);
//	}
//}