//#include <iostream>
//#include <vector>
//using namespace std;
//
////Написать программу, в которой нужно найти максимальный элемент вектора и вывести на экран.
//
//void main() {
//	vector<int>vect = {4, 7, 3, 8, 5};
//	int max = vect[0];
//	for (int i = 0; i < vect.size(); i++) {
//		if (vect[i] > max) {
//			max = vect[i];
//		}
//	}
//	printf("Max element is %d", max);
//}