//#include <iostream>
//#include <deque>
//using namespace std;
//
////Написать программу, в которой нужно найти минимальный элемент дэки и добавить его в начало, с выводом на экран 
//
//void main() {
//	deque<int>deq = { 5, 3, 9, 2, 7 };
//	int min = deq[0];
//
//	for (int i = 0; i < deq.size(); i++) {
//		if (deq[i] < min) {
//			min = deq[i];
//		}
//	}
//
//	deq.push_front(min);
//
//	for (int i = 0; i < deq.size(); i++) {
//		printf("%d\t", deq[i]);
//	}
//}