//#include <iostream>
//#include <vector>
//using namespace std;
//
////Написать программу, в которой нужно найти сумму минимального и максимального элементов массива, с выводом на экран
//
//void main() {
//	vector<int>vec = { 4, 1, 8, 5, 9 };
//	int max = vec[0];
//
//	for (int i = 0; i < vec.size(); i++) {
//		if (vec[i] > max) {
//			max = vec[i];
//		}
//	}
//	int min = vec[0];
//
//	for (int i = 0; i < vec.size(); i++) {
//		if (min > vec[i]) {
//			min = vec[i];
//		}
//	}
//
//	printf("Min is %d\nMax is %d", min, max);
//}