const questionsFixed = [
  "Для чего предназначен дробовик Remington 870?",
  "Что включает конструкция дробовика Remington 870?",
  "Что требует использование дробовика Remington 870?",
  "Чем является дробовик Remington 870?",
  "Что появляется благодаря разработке Remington 870?",
  "Что обеспечивает дробовик Remington 870?",
  "Чем способствует использование Remington 870?",
  "Для чего могут быть адаптированы дробовики Remington 870?",
  "Чем подчеркивается важность дробовика Remington 870?",
  "Что усовершенствуют инновации в области Remington 870?",
  "На каких видах патронов работает дробовик Remington 870?",
  "Чем является обучение стрельбе из Remington 870?",
  "Чем отражает эволюция дробовика Remington 870?",
  "Чем отражает история дробовика Remington 870?",
  "Чем являются первые модели Remington 870?",
  "Что включают современные модели Remington 870?",
  "Чем подчеркивается роль дробовика Remington 870?",
  "На что влияют кулинарные традиции в армии?",
  "Для чего важен дробовик Remington 870?",
  "К чему приводят эксперименты с дробовиком Remington 870?",
  "Что требует уход за дробовиком Remington 870?",
  "Чем способствует дробовик Remington 870?",
  "Чем распространено использование дробовика Remington 870?",
  "Чем отражает развитие дробовика Remington 870?",
  "Чем способствует технологический прогресс?",
  "Что позволяют инновации в области дробовика Remington 870?",
  "Чем отражает эволюция дробовика Remington 870?",
  "Чем является безопасность при использовании Remington 870?",
  "От чего зависит эффективность дробовика Remington 870?",
  "Чем подчеркивается социальная значимость дробовика Remington 870?",
  "Какие виды спорта используют дробовик Remington 870?",
  "Какие характеристики имеет дробовик Remington 870?",
  "Что требует чистка дробовика Remington 870?",
  "Какие материалы используются в конструкции Remington 870?",
  "Что обеспечивает популярность Remington 870 в полиции?",
  "Что требует стрельба из дробовика Remington 870?",
  "Чем является процесс производства дробовика Remington 870?",
  "Какие виды боеприпасов используются с Remington 870?",
  "Что включает уход за дробовиком Remington 870?",
  "Чем подчеркивается качество дробовика Remington 870?",
  "Чем является популярность Remington 870 среди военных?",
  "Какие аксессуары улучшат функциональность Remington 870?",
  "Что требует модификация Remington 870?",
  "Какие тактики охоты используют Remington 870?",
  "Какие элементы безопасности присутствуют в Remington 870?",
  "Чем является универсальность Remington 870?",
  "Что включает процесс заряжания Remington 870?",

  "Что требует транспортировка дробовика Remington 870?",

  "Какие цели поддерживают дробовик Remington 870?",
  "Чем являются различия между моделями Remington 870?",
  "Чем поддерживается точность стрельбы из Remington 870?",
  "Чем является надежность дробовика Remington 870?",
  "Какие цели поддерживают использование Remington 870?",
  "Чем подчеркивается долговечность Remington 870?",
  "Какие возможности для настройки предоставляет Remington 870?",
  "Чем отличается конструкция Remington 870?",
  "Чем уникален процесс сборки Remington 870?",
  "Какие особенности имеют тактические модели Remington 870?",
  "Чем подчеркивается функциональность Remington 870?",
  "Какие технологии используются в Remington 870?",
  "Какие патроны используются в Remington 870?",
  "Чем является обучение обращению с Remington 870?",
  "Какие условия эксплуатации поддерживает Remington 870?",
  "Что включает конструкция приклада Remington 870?",
  "Какие мероприятия требуют использования Remington 870?",
  "Чем подчеркивается безопасность использования Remington 870?",
  "Чем являются преимущества дробовика Remington 870 в охоте?",
  "Какие материалы используются в отделке Remington 870?",
  "Чем подчеркивается устойчивость Remington 870?",
  "Какие инновации внедрены в Remington 870?",
  "Чем являются модификации Remington 870?",
  "Чем подчеркивается надежность дробовика Remington 870?",
  "Какие функции имеют современные модели Remington 870?",

  "Чем обеспечивается надежность Remington 870?",
  "Что включает конструкция дробовика Remington 870?",
  "Чем отличается процесс чистки Remington 870?",
  "Чем является эргономичность Remington 870?",
  "Какие материалы используются в производстве Remington 870?",
  "Чем подчеркивается долговечность Remington 870?",
  "Чем является эффективность Remington 870 в самообороне?",
  "Что обеспечивает точность стрельбы из Remington 870?",
  "Какие модификации существуют для Remington 870?",
  "Чем подчеркивается роль Remington 870 в охоте?",
  "Что включает обучение обращению с Remington 870?",
  "Какие патроны используются с Remington 870?",
  "Чем является надежность Remington 870 в экстремальных условиях?",
  "Что требует правильное хранение Remington 870?",
  "Чем подчеркивается важность регулярной чистки Remington 870?",
  "Что включает процесс заряжания Remington 870?",
  "Какие особенности имеют тактические модели Remington 870?",
  "Чем обеспечивается простота использования Remington 870?",
  "Чем является популярность Remington 870 среди охотников?",
  "Какие преимущества имеет Remington 870 в охоте?",
  "Чем подчеркивается универсальность Remington 870 для спортивной стрельбы?",
  "Что включает обслуживание Remington 870?",

  "Что демонстрирует видео по разборке и сборке Remington 870?",
  "Что демонстрирует видео по чистке Remington 870?",
  "Что демонстрирует видео по стрельбе из Remington 870?",
  "Как выглядят патроны для Remington 870?",
  "Как выглядит полицейская модель Remington 870?",
];

function displayAnswers() {
  let answer = document.querySelector("#answer");
  console.log("ans", answer);
  // Очищаем содержимое элемента, в который будут добавляться ответы
  answer.innerHTML = "";
  console.log("func");

  // Перебираем массив вопросов
  questionsFixed.forEach(function (question, index) {
    console.log("foreach");
    // Получаем ответ на текущий вопрос
    const answerText = getAnswer(question);

    // Добавляем вопрос и ответ в элемент с id="answer"
    answer.innerHTML +=
      "<div style='font-weight: 700'>" +
      (index + 1) +
      ". " +
      question +
      "</div>" +
      answerText +
      "\n";
  });
}

window.onload = function () {
  displayAnswers(questions);
};

const knowledge = [
  [
    "Дробовик Remington 870",
    "предназначен",
    "для охоты, спортивной стрельбы и самообороны.",
  ],
  [
    "Конструкция дробовика Remington 870",
    "включает",
    "стальной ствольный короб, приклад и цевье.",
  ],
  [
    "Использование дробовика Remington 870",
    "требует",
    "регулярной чистки и технического обслуживания.",
  ],
  [
    "Дробовик Remington 870",
    "является",
    "одним из самых популярных дробовиков в мире.",
  ],
  [
    "Благодаря разработке Remington 870",
    "появляется",
    "надёжное и универсальное оружие для разных целей.",
  ],
  [
    "Дробовик Remington 870",
    "обеспечивает",
    "высокую точность и надежность при стрельбе.",
  ],
  [
    "Использование Remington 870",
    "способствует",
    "повышению безопасности и эффективности охоты.",
  ],
  [
    "Дробовики Remington 870",
    "могут быть",
    "адаптированы для различных типов охоты и стрелковых соревнований.",
  ],
  [
    "Важность дробовика Remington 870",
    "подчеркивается",
    "его широким применением в охоте и самообороне.",
  ],
  [
    "Инновации в области Remington 870",
    "усовершенствуют",
    "его конструкцию и производительность.",
  ],
  [
    "Дробовик Remington 870",
    "работает",
    "на различных видах патронов, включая дробь и пули.",
  ],
  [
    "Обучение стрельбе из Remington 870",
    "является",
    "ключевым для эффективного и безопасного использования.",
  ],
  [
    "Эволюция дробовика Remington 870",
    "отражает",
    "постоянное стремление к улучшению и адаптации.",
  ],
  [
    "История дробовика Remington 870",
    "отражает",
    "долгую традицию качества и надежности.",
  ],
  [
    "Первые модели Remington 870",
    "являются",
    "простыми и надежными огнестрельными оружиями.",
  ],
  [
    "Современные модели Remington 870",
    "включают",
    "улучшенные материалы и технологии.",
  ],
  [
    "Роль дробовика Remington 870",
    "подчеркивается",
    "его эффективностью в различных ситуациях.",
  ],
  [
    "Кулинарные традиции в армии",
    "влияют",
    "на организацию и стандарты полевого питания.",
  ],
  [
    "Дробовик Remington 870",
    "важен",
    "для обеспечения безопасности и успеха охоты.",
  ],
  [
    "Эксперименты с дробовиком Remington 870",
    "приводят",
    "к улучшению его характеристик и возможностей.",
  ],
  [
    "Уход за дробовиком Remington 870",
    "требует",
    "регулярной чистки и смазки всех компонентов.",
  ],
  [
    "Дробовик Remington 870",
    "способствует",
    "обеспечению эффективной самообороны.",
  ],
  [
    "Использование дробовика Remington 870",
    "распространено",
    "среди охотников и стрелков по всему миру.",
  ],
  [
    "Развитие дробовика Remington 870",
    "отражает",
    "постоянное стремление к совершенствованию.",
  ],
  [
    "Технологический прогресс",
    "способствует",
    "разработке более надежных и эффективных моделей Remington 870.",
  ],
  [
    "Инновации в области дробовика Remington 870",
    "позволяют",
    "повысить его функциональность и удобство.",
  ],
  [
    "Эволюция дробовика Remington 870",
    "отражает",
    "необходимость адаптации к современным требованиям.",
  ],
  [
    "Безопасность при использовании Remington 870",
    "является",
    "приоритетом для всех пользователей.",
  ],
  [
    "Эффективность дробовика Remington 870",
    "зависит",
    "от правильного ухода и использования.",
  ],
  [
    "Социальная значимость дробовика Remington 870",
    "подчеркивается",
    "его ролью в охоте и самообороне.",
  ],
  [
    "Дробовик Remington 870",
    "используется",
    "в различных стрелковых видах спорта.",
  ],
  [
    "Дробовик Remington 870",
    "имеет",
    "характеристики, такие как надежность, точность и долговечность.",
  ],
  [
    "Чистка дробовика Remington 870",
    "требует",
    "использования специальных инструментов и средств.",
  ],
  [
    "Для Remington 870",
    "доступны",
    "различные аксессуары, такие как оптические прицелы и приклады.",
  ],
  [
    "В конструкции Remington 870",
    "используются",
    "высококачественные материалы, такие как сталь и полимеры.",
  ],
  [
    "Популярность Remington 870 в полиции",
    "обеспечивает",
    "его надежность и эффективность в критических ситуациях.",
  ],
  [
    "Стрельба из дробовика Remington 870",
    "требует",
    "определенных навыков и знаний.",
  ],
  [
    "Процесс производства дробовика Remington 870",
    "является",
    "сложным и высокотехнологичным.",
  ],
  [
    "С Remington 870",
    "используются",
    "различные виды боеприпасов для различных целей.",
  ],
  [
    "Уход за дробовиком Remington 870",
    "включает",
    "регулярную чистку и проверку всех частей.",
  ],
  [
    "Качество дробовика Remington 870",
    "подчеркивается",
    "использованием высококачественных материалов.",
  ],
  [
    "Популярность Remington 870 среди военных",
    "является",
    "результатом его надежности и эффективности.",
  ],
  [
    "Для Remington 870",
    "доступны",
    "различные аксессуары, которые улучшают его функциональность.",
  ],
  [
    "Модификация Remington 870",
    "требует",
    "учета целей использования и соответствующих компонентов.",
  ],
  [
    "Тактики охоты с Remington 870",
    "включают",
    "различные методы и приемы для повышения эффективности.",
  ],
  [
    "В Remington 870",
    "присутствуют",
    "различные элементы безопасности для предотвращения несчастных случаев.",
  ],
  [
    "Универсальность Remington 870",
    "является",
    "одним из ключевых факторов его популярности.",
  ],
  [
    "Процесс заряжания Remington 870",
    "включает",
    "вставку патронов в магазин и затвор.",
  ],

  [
    "Транспортировка дробовика Remington 870",
    "требует",
    "использования специального кейса или чехла.",
  ],

  [
    "Дробовик Remington 870",
    "поддерживает",
    "различные цели, включая охоту и самооборону.",
  ],
  [
    "Различия между моделями Remington 870",
    "являются",
    "результатом различных требований и условий использования.",
  ],
  [
    "Ключевые компоненты в Remington 870",
    "включают",
    "ствольную коробку, ствол и приклад.",
  ],
  [
    "Надежность дробовика Remington 870",
    "является",
    "одним из его главных преимуществ.",
  ],
  [
    "Использование Remington 870",
    "поддерживает",
    "различные цели, включая охоту и спортивную стрельбу.",
  ],
  [
    "Долговечность Remington 870",
    "подчеркивается",
    "использованием высококачественных материалов и технологий.",
  ],
  [
    "Remington 870",
    "предоставляет",
    "возможности для настройки под индивидуальные потребности пользователя.",
  ],
  [
    "Конструкция Remington 870",
    "отличается",
    "простотой и надежностью, что делает его популярным.",
  ],
  [
    "Процесс сборки Remington 870",
    "является",
    "примером инженерного мастерства и точности.",
  ],
  [
    "Тактические модели Remington 870",
    "имеют",
    "различные особенности для использования в сложных условиях.",
  ],
  [
    "Функциональность Remington 870",
    "подчеркивается",
    "его широким спектром применения.",
  ],
  [
    "В Remington 870",
    "используются",
    "современные технологии для повышения надежности и эффективности.",
  ],
  [
    "С Remington 870",
    "используются",
    "различные патроны, такие как дробь и пули.",
  ],
  [
    "Обучение обращению с Remington 870",
    "является",
    "важным для безопасного и эффективного использования.",
  ],
  [
    "Remington 870",
    "поддерживает",
    "различные условия эксплуатации, включая экстремальные температуры.",
  ],
  [
    "Конструкция приклада Remington 870",
    "включает",
    "эргономичные элементы для удобства использования.",
  ],
  [
    "Использование Remington 870",
    "требует",
    "соблюдения определенных правил и рекомендаций.",
  ],
  [
    "Безопасность использования Remington 870",
    "подчеркивается",
    "наличием различных предохранительных механизмов.",
  ],
  [
    "Преимущества дробовика Remington 870 в охоте",
    "являются",
    "высокая точность и надежность.",
  ],
  [
    "В отделке Remington 870",
    "используются",
    "различные материалы, такие как дерево и синтетика.",
  ],
  [
    "Устойчивость Remington 870",
    "подчеркивается",
    "его конструкцией и использованием качественных материалов.",
  ],
  [
    "В Remington 870",
    "внедрены",
    "различные инновации для повышения его производительности.",
  ],
  [
    "Модификации Remington 870",
    "являются",
    "результатом стремления к улучшению и адаптации.",
  ],
  [
    "Надежность дробовика Remington 870",
    "подчеркивается",
    "его долгой историей и качеством исполнения.",
  ],
  [
    "Современные модели Remington 870",
    "имеют",
    "различные функции для повышения удобства и безопасности.",
  ],
  [
    "Уход за дробовиком Remington 870",
    "включает",
    "регулярную чистку, смазку и проверку всех компонентов.",
  ],
  [
    "Качество дробовика Remington 870",
    "подчеркивается",
    "использованием высококачественных материалов и проверенных технологий.",
  ],
  [
    "Популярность Remington 870 среди военных",
    "является",
    "результатом его надежности и эффективности в боевых условиях.",
  ],
  [
    "Модификация Remington 870",
    "требует",
    "учета целей использования и соответствующих компонентов.",
  ],
  [
    "Элементы безопасности в Remington 870",
    "включают",
    "механический предохранитель и защитные механизмы.",
  ],
  [
    "Универсальность Remington 870",
    "является",
    "одним из ключевых факторов его популярности среди пользователей.",
  ],
  [
    "Надежность Remington 870",
    "обеспечивается",
    "простотой конструкции и использованием качественных материалов.",
  ],
  [
    "Конструкция дробовика Remington 870",
    "включает",
    "ствол, ствольную коробку, приклад и цевье.",
  ],
  [
    "Процесс чистки Remington 870",
    "отличается",
    "использованием специальных инструментов и средств для удаления загрязнений.",
  ],
  [
    "Эргономичность Remington 870",
    "является",
    "результатом продуманной конструкции приклада и цевья.",
  ],
  [
    "Материалы, используемые в производстве Remington 870",
    "включают",
    "сталь и синтетические полимеры.",
  ],
  [
    "Долговечность Remington 870",
    "подчеркивается",
    "его способностью выдерживать интенсивное использование и неблагоприятные условия.",
  ],
  [
    "Эффективность Remington 870 в самообороне",
    "является",
    "результатом его мощности и простоты использования.",
  ],
  [
    "Точность стрельбы из Remington 870",
    "обеспечивается",
    "качеством изготовления ствола и использованием подходящих боеприпасов.",
  ],
  [
    "Модификации для Remington 870",
    "существуют",
    "для охоты, самообороны и тактических целей.",
  ],
  [
    "Роль Remington 870 в охоте",
    "подчеркивается",
    "его универсальностью и надежностью.",
  ],
  [
    "Обучение обращению с Remington 870",
    "включает",
    "инструктаж по технике безопасности и практические занятия.",
  ],
  [
    "Патроны, используемые с Remington 870",
    "включают",
    "дробовые патроны и пули.",
  ],
  [
    "Надежность Remington 870 в экстремальных условиях",
    "является",
    "результатом его прочной конструкции и качественных материалов.",
  ],
  [
    "Правильное хранение Remington 870",
    "требует",
    "использования безопасного места и регулярной проверки состояния оружия.",
  ],
  [
    "Важность регулярной чистки Remington 870",
    "подчеркивается",
    "необходимостью поддержания его работоспособности и безопасности.",
  ],
  [
    "Процесс заряжания Remington 870",
    "включает",
    "вставку патронов в магазин и подачу их в патронник.",
  ],
  [
    "Особенности тактических моделей Remington 870",
    "включают",
    "усовершенствованные прицельные приспособления и возможности для модификации.",
  ],
  [
    "Простота использования Remington 870",
    "обеспечивается",
    "интуитивно понятной конструкцией и эргономичным дизайном.",
  ],
  [
    "Популярность Remington 870 среди охотников",
    "является",
    "результатом его универсальности и надежности.",
  ],
  [
    "Преимущества Remington 870 в охоте",
    "включают",
    "высокую точность, надежность и универсальность.",
  ],
  [
    "Универсальность Remington 870 для спортивной стрельбы",
    "подчеркивается",
    "его возможностью адаптации для различных дисциплин.",
  ],
  [
    "Обслуживание Remington 870",
    "включает",
    "регулярную проверку состояния всех компонентов и своевременное устранение неисправностей.",
  ],
  [
    "Видео по разборке и сборке Remington 870",
    "демонстрирует",
    'следующее <br/><br/> <video controls width="200"><source src="../videos/remington_assembly.mp4" type="video/mp4"></video>',
  ],
  [
    "Видео по чистке Remington 870",
    "демонстрирует",
    'следующее <br/><br/> <video controls width="200"><source src="../videos/remington_cleaning.mp4" type="video/mp4"></video>',
  ],
  [
    "Видео по стрельбе из Remington 870",
    "демонстрирует",
    'следующее <br/><br/> <video controls width="200"><source src="../videos/remington_shooting.mp4" type="video/mp4"></video>',
  ],
  [
    "Патроны для Remington 870",
    "выглядят",
    'так <br/><br/> <img src="../img/bullets.jpg" width="200"/>',
  ],
  [
    "Полицейская модель Remington 870",
    "выглядит",
    'так <br/><br/> <img src="../img/police.jpg" width="200"/>',
  ],
];
var blacklist = ["замена", "замены", "атрибут", "маршрут", "член", "нет"];
var endings = [
  ["такое", " – это"],
  ["ет", "(ет|ут|ют)"],
  ["ут", "(ет|ут|ют)"],
  ["ют", "(ет|ут|ют)"], //1 спряжение
  ["ит", "(ит|ат|ят)"],
  ["ат", "(ит|ат|ят)"],
  ["ят", "(ит|ат|ят)"], //2 спряжение
  ["ется", "(ет|ут|ют)ся"],
  ["утся", "(ет|ут|ют)ся"],

  ["ются", "(ет|ут|ют)ся"], //1 спряжение, возвратные

  ["ится", "(ит|ат|ят)ся"],

  ["атся", "(ит|ат|ят)ся"],

  ["ятся", "(ит|ат|ят)ся"], //2 спряжение, возвратные

  ["ен", "ен"],

  ["ена", "ена"],

  ["ено", "ено"],

  ["ены", "ены"],

  ["ан", "ан"],

  ["ана", "ана"],

  ["ано", "ано"],

  ["аны", "аны"],

  ["жен", "жен"],

  ["жна", "жна"],

  ["жно", "жно"],

  ["жны", "жны"], //краткие прилагательные
];

function getEnding(word) {
  //проверка слова на совпадение по черному списку в массиве blacklist

  if (blacklist.indexOf(word) !== -1) return -1;
  //перебор псевдоокончаний в массиве endings

  for (var j = 0; j < endings.length; j++) {
    //проверка, оканчивается ли слово word на j-ое псевдоокончание

    //сменится          8          -   4
    if (word.substring(word.length - endings[j][0].length) == endings[j][0]) {
      //возврат номера найденного псевдоокончания для сказуемого
      return j;
    }
  }

  //если совпадений нет, то возврат -1

  return -1;
}

function small1(str) {
  return str.substring(0, 1).toLowerCase() + str.substring(1);
}

function big1(str) {
  return str.substring(0, 1).toUpperCase() + str.substring(1);
}

function getAnswer(question) {
  //флаг, найден ли ответ на вопрос
  var result = false;

  //формируемый функцией ответ на вопрос – вначале пустой
  var answer = "";
  //преобразование текста из параметра функции question функцией small1()
  //чтобы сделать первую букву в тексте вопроса прописной
  var txt = small1(question);

  //знаки препинания
  var separators = "'\",.!?()[]\\/";

  //добавление пробелов перед знаками препинания
  for (var i = 0; i < separators.length; i++)
    txt = txt.replace(separators[i], " " + separators[i]);
  //массив слов и знаков препинания, отделенных пробелами
  var words = txt.split(" ");

  //перебор слов в массиве слов из вопроса
  for (var i = 0; i < words.length; i++) {
    //поиск номера псевдоокончания с использованием вспомогательной функции  getEnding() запись его в переменную ending

    var ending = getEnding(words[i]);

    if (ending >= 0) {
      //замена псевдоокончания на набор возможных окончаний, хранящихся //во втором столбце массива

      words[i] =
        words[i].substring(0, words[i].length - endings[ending][0].length) +
        endings[ending][1];

      //создание регулярного выражения для поиска по сказуемому из вопроса
      //var predicate = new RegExp(words[i]);
      let predicate = new RegExp(".*" + words[i] + ".*");

      if (endings[ending][0] == endings[ending][1]) {
        predicate = new RegExp(".*" + words[i] + " " + words[i + 1] + ".*"); // захватываем следующее за ним слово
        i++;
      }

      //создание регулярного выражения для поиска по подлежащему из вопроса. пример «Как рассчитывается площадь квадрата» после сказуемого будет сформировано
      //регулярное выражение  для подлежащего: «.*площадь.*квадрата.*»,

      let subjectReg = words.slice(i + 1).join(".*");
      //words.slice(i + 1): Метод slice используется для создания нового массива, начиная с элемента i + 1 и до конца массива words. Он возвращает подмассив, не изменяя
      //оригинальный массив.

      //.join(".*"): Метод join используется для объединения элементов массива в строку с указанным разделителем. В данном случае, элементы массива будут
      //объединены с использованием строки ".*" в качестве разделителя.

      //только если в подлежащем больше трех символов
      if (subjectReg.length > 3) {
        let subject = new RegExp(".*" + subjectReg.toLowerCase() + ".*");

        //поиск совпадений с шаблонами среди связей семантической сети
        for (let j = 0; j < knowledge.length; j++) {
          if (
            predicate.test(knowledge[j][1].toLowerCase()) &&
            (subject.test(knowledge[j][0].toLowerCase()) ||
              subject.test(knowledge[j][2].toLowerCase()))
          ) {
            //создание простого предложения из семантической связи
            answer += big1(
              knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2]
            );
            result = true;
          }
        }

        //если совпадений с двумя шаблонами нет,
        if (!result) {
          //поиск совпадений только с шаблоном подлежащего
          for (let j = 0; j < knowledge.length; j++) {
            if (
              subject.test(
                knowledge[j][0].toLowerCase() ||
                  subject.test(knowledge[j][2].toLowerCase())
              )
            ) {
              //создание простого предложения из семантической связи
              answer += big1(
                knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2]
              );
              result = true;
              break;
            }
          }
        }
      }
    }
  }
  //если ответа нет
  if (!result) answer = "Ответ не найден.";
  return answer;
}

// for (i = 1; i <= 209; i++) {
//   if (confirm("Продолжить диалог?")) {
//     question = prompt("Введите вопрос", "");

//     alert(getAnswer(question));
//   } else {
//     break;
//   }
// }

// function runScript() {
//   for (let i = 0; i < questionsFixed.length; i++) {
//       if (confirm("Продолжить диалог?")) {
//           let userQuestion = prompt("Введите вопрос", questionsFixed[i]);
//           alert(getAnswer(userQuestion));
//       } else {
//           break;
//       }
//   }
// }

function runScript() {
  for (let i = 0; i < questionsFixed.length; i++) {
    console.log(i + 1 + ". " + questionsFixed[i] + "\n");
    console.log(i + 1 + ". " + getAnswer(questionsFixed[i]) + "\n");
  }
}

runScript();

// for (let i = 0; i < questions.length; i++) {
//   console.log(getAnswer(questions[i]) + "\n");
// }

// question = prompt("Введите вопрос", "");
// alert(getAnswer(question));

// вот вопросы касательно полевой кухни

// const questions = [
//       "Для чего предназначена полевая кухня?",
//       "Что включает кулинарное оборудование?",
//       "Что требует питание в полевых условиях?",
//       "Чем является полевая кухня?",
//       "Что появляется благодаря развитию полевых кухонь?",
//       "Что обеспечивает полевая кухня?",
//       "Что делает мобильность полевых кухонь?",
//       "Что способствует технологический прогресс?",
//       "Для чего могут быть адаптированы полевые кухни?",
//       "Чем подчеркивается важность полевых кухонь?",
//       "Что усовершенствуют инновации в области полевой кухни?",
//       "На каких видах топлива работают полевые кухни?",
//       "Чем является обучение персонала?",
//       "Чем отражает эволюция полевых кухонь?",
//       "Что способствует поддержанию боевого духа и здоровья солдат?",
//       "Чем отражает история полевой кухни?",
//       "Чем являются первые полевые кухни?",
//       "Что включают современные полевые кухни?",
//       "Чем подчеркивается роль полевой кухни?",
//       "На что влияют кулинарные традиции в армиях?",
//       "Для чего важны полевые кухни?",
//       "К чему приводят эксперименты с полевой кухней?",
//       "Что требует строительство полевых кухонь?",
//       "Чем способствует полевая кухня?",
//       "Чем распространено использование полевых кухонь?",
//       "Чем отражает развитие полевых кухонь?",
//       "Чем способствует технологический прогресс?",
//       "Что позволяют инновации в области полевой кухни?",
//       "Чем отражает эволюция полевых кухонь?",
//       "Чем является безопасность пищи?",
//       "От чего зависит эффективность полевых кухонь?",
//       "Чем подчеркивается социальная значимость полевой кухни?",
//     ];

// обрати внимание что после вопросительного слова всегда идет глагол а потом подлежащее

// вот ответы

// const knowledge = [
//   [
//     "Полевая кухня",
//     "предназначена",
//     "для приготовления пищи в условиях полевых операций и экспедиций.",
//   ],
//   [
//     "Кулинарное оборудование",
//     "включает",
//     "различные переносные плиты, горелки, котлы и посуду для приготовления пищи.",
//   ],
//   [
//     "Питание в полевых условиях",
//     "требует",
//     "особого внимания к сохранности и качеству продуктов.",
//   ],
//   [
//     "Полевая кухня",
//     "является",
//     "неотъемлемой частью военных операций и экспедиций.",
//   ],
//   [
//     "Благодаря развитию полевых кухонь",
//     "появляется",
//     "более компактное и эффективное оборудование.",
//   ],
//   [
//     "Полевая кухня",
//     "обеспечивает",
//     "возможность готовить еду вдали от обычных кухонных условий.",
//   ],
//   [
//     "Мобильность полевых кухонь",
//     "делает",
//     "их неотъемлемой частью военных стратегий и тактик.",
//   ],
//   [
//     "Полевые кухни",
//     "могут быть",
//     "адаптированы для различных климатических условий и типов местности.",
//   ],
//   [
//     "Важность полевых кухонь",
//     "подчеркивается",
//     "их способностью обеспечивать воинов питательной и вкусной пищей.",
//   ],
//   [
//     "Инновации в области полевой кухни",
//     "усовершенствуют",
//     "процесс приготовления и сохранности продуктов питания.",
//   ],
//   [
//     "Полевые кухни",
//     "работают",
//     "на различных видах топлива, что делает их универсальными.",
//   ],
//   [
//     "Обучение персонала",
//     "является",
//     "важным аспектом использования полевых кухонь для обеспечения безопасности и эффективности.",
//   ],
//   [
//     "Эволюция полевых кухонь",
//     "отражает",
//     "необходимость адаптации к изменяющимся условиям и потребностям.",
//   ],
//   [
//     "Разнообразие блюд",
//     "способствует",
//     "поддержанию боевого духа и здоровья солдат.",
//   ],
//   [
//     "История полевой кухни",
//     "отражает",
//     "необходимость обеспечения питания в условиях полевых операций с древних времен.",
//   ],
//   [
//     "Первые полевые кухни",
//     "являются",
//     "простыми конструкциями, основанными на доступных материалах и технологиях.",
//   ],
//   [
//     "Современные полевые кухни",
//     "включают",
//     "различные инновационные технологии для повышения эффективности и безопасности.",
//   ],
//   [
//     "Роль полевой кухни",
//     "подчеркивается",
//     "ее способностью обеспечивать энергетически насыщенную пищу в отдаленных районах.",
//   ],
//   [
//     "Кулинарные традиции в армиях",
//     "влиюят",
//     "на организацию и стандарты полевого питания.",
//   ],
// ];

// обрати внимание что здесь всегда 1 параметром идет подлежащее из вопроса, а 2 - глагол из вопроса. 3 параметр просто ответ

// теперь требование: сгенерируй мне 100 вопросов касательно дробовика remington 870 и соответствующие ответы на них (используй такую же структуру вопроса и ответа как я и скинул)
