const MyRoutes = {
    minskdz : {
        yesterday : [
            {
                id: 1,
                time1: "9:33",
                place1: "Минск (Институт Культуры)",
                time2: "50 минут",
                cost: "1.25 BYN",
                time3: "10:30",
                place2: "Дзержинск"
            },
            {
                id: 2,
                time1: "12:03",
                place1: "Минск (Институт Культуры)",
                time2: "51 минута",
                cost: "1.25 BYN",
                time3: "12:54",
                place2: "Дзержинск",
            },
            {
                id: 3,
                time1: "17:05",
                place1: "Минск (Институт Культуры)",
                time2: "52 минута",
                cost: "1.25 BYN",
                time3: "17:57",
                place2: "Дзержинск",
            },
            {
                id: 4,
                time1: "19:58",
                place1: "Минск (Минск-Пассажирский)",
                time2: "1ч 10мин",
                cost: "1.25 BYN",
                time3: "20:56",
                place2: "Дзержинск",
            },
            {
                id: 5,
                time1: "21:46",
                place1: "Минск (Минск-Пассажирский)",
                time2: "53 минуты",
                cost: "1.25 BYN",
                time3: "22:39",
                place2: "Дзержинск",
            }
        ],
        today : [
            {
                id: 1,
                time1: "9:39",
                place1: "Минск (Институт Культуры)",
                time2: "51 минута",
                cost: "1.25р",
                time3: "10:30",
                place2: "Дзержинск"
            },
            {
                id: 2,
                time1: "12:03",
                place1: "Минск (Институт Культуры)",
                time2: "51 минута",
                cost: "1.25р",
                time3: "12:54",
                place2: "Дзержинск",
            },
            {
                id: 3,
                time1: "17:05",
                place1: "Минск (Институт Культуры)",
                time2: "52 минута",
                cost: "1.25р",
                time3: "17:57",
                place2: "Дзержинск",
            },
            {
                id: 4,
                time1: "19:58",
                place1: "Минск (Минск-Пассажирский)",
                time2: "1ч 10мин",
                cost: "1.25р",
                time3: "20:56",
                place2: "Дзержинск",
            },
            {
                id: 5,
                time1: "21:46",
                place1: "Минск (Минск-Пассажирский)",
                time2: "53 минуты",
                cost: "1.25р",
                time3: "22:39",
                place2: "Дзержинск",
            }
            
        ],
        tomorrow : [
            {
                id: 1,
                time1: "9:45",
                place1: "Минск (Институт Культуры)",
                time2: "50 минут",
                cost: "1.25р",
                time3: "10:30",
                place2: "Дзержинск"
            },
            {
                id: 2,
                time1: "12:03",
                place1: "Минск (Институт Культуры)",
                time2: "51 минута",
                cost: "1.25р",
                time3: "12:54",
                place2: "Дзержинск",
            },
            {
                id: 3,
                time1: "17:05",
                place1: "Минск (Институт Культуры)",
                time2: "52 минута",
                cost: "1.25р",
                time3: "17:57",
                place2: "Дзержинск",
            },
            {
                id: 4,
                time1: "19:58",
                place1: "Минск (Минск-Пассажирский)",
                time2: "1ч 10мин",
                cost: "1.25р",
                time3: "20:56",
                place2: "Дзержинск",
            },
            {
                id: 5,
                time1: "21:46",
                place1: "Минск (Минск-Пассажирский)",
                time2: "53 минуты",
                cost: "1.25р",
                time3: "22:39",
                place2: "Дзержинск",
            }
        ]
    }
}
export default MyRoutes;